leeebo/learning_freertos/queue_trigger_task_yield/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APPTRACE_DEST_UART1=y
CONFIG_APPTRACE_UART_BAUDRATE=2000000
CONFIG_APPTRACE_UART_TX_BUFF_SIZE=10240
CONFIG_APPTRACE_SV_ENABLE=y
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=1152000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
